//Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет. 
//Отрицательные числа должны нормально работать.

Console.WriteLine("Введите трехзначное число ");
string number1 = Console.ReadLine()!;
if (number1[0] == '-')
{
    if (number1.Length >= 4)
    {
        Console.WriteLine (number1 [3]);
    }
    else
    {
        Console.WriteLine ("число меньше трех знаков");
    }
}
else
{
     if (number1.Length >= 3)
    {
        Console.WriteLine (number1 [2]);
    }
    else
    {
        Console.WriteLine ("число меньше трех знаков");
    }
}
