//Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
/*
Console.WriteLine("Введите номер для недели от 1 до 7 ");
int number1 = int.Parse(Console.ReadLine()!);

if (number1 > 0 && number1 <8)
{
    if (number1 == 6 || number1 == 7)
    {
        Console.WriteLine ("Выходной день");
    }
    else
    {
        Console.WriteLine ("Будний день");
    }
}