/ Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

Console.WriteLine("Введите трехзначное число ");
int number1 = int.Parse(Console.ReadLine()!);

if ((number1 >= 100) && (number1 <= 1000))
{
    int firstDigit = number1 % 100;
    int secondDigit = firstDigit / 10;
    Console.WriteLine (secondDigit);
}